In [9]:
import pandas as pd

titanic_lost = pd.read_csv('lost.csv', sep=';')
titanic_survived = pd.read_csv('survivors.csv', sep=',')
titanic_victims = pd.read_csv('victims.csv', sep=',')

In [10]:
print(titanic_lost.shape)
print(titanic_survived.shape)
print(titanic_victims.shape)

(1256, 9)
(500, 7)
(1496, 7)

In [11]:
complete = pd.concat([titanic_survived, titanic_victims])

In [12]:
complete.head()

,Name,Age,Class/Dept,Ticket,Joined,Job,Boat [Body]
0,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,CA2673£20 5s,Southampton,NaN,A
1,"ABELSETH, Miss Kalle (Karen) Marie Kristiane",16,3rd Class Passenger,348125£7 13s,Southampton,NaN,16*
2,"ABELSETH, Mr Olaus Jørgensen",25,3rd Class Passenger,348122£7 13s,Southampton,Farmer,A
3,"ABELSON, Mrs Anna",28,2nd Class Passenger,3381£24,Cherbourg,NaN,NaN
4,"ABĪ SA'B, Mrs Sha'nīnah",38,3rd Class Passenger,2688£7 4s 7d,Cherbourg,NaN,NaN

In [14]:
complete.to_csv('complete.csv', header=True)